fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Плановые отпуска сотрудников на год.</comment>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <comment>Год, на который составлен график.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Год) Тогда
		Объект.Год = Год(ТекущаяДатаСеанса()) + 1;
	КонецЕсли;

	НастроитьПодсветкуПревышения();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", ПоместитьДанныеГрафика());
	ПараметрыФормы.Вставить("Год", Объект.Год);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",
		ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Помещает строки графика во временное хранилище для формы анализа.
// Передача данных между формами выполняется через временное хранилище.
//
// Возвращаемое значение:
//  Строка - адрес данных во временном хранилище.
//
&НаСервере
Функция ПоместитьДанныеГрафика()

	ДанныеОтпусков = Объект.ОтпускаСотрудников.Выгрузить(,
		"Сотрудник, ДатаНачала, ДатаОкончания");

	Возврат ПоместитьВоВременноеХранилище(ДанныеОтпусков, УникальныйИдентификатор);

КонецФункции

// Настраивает условное оформление таблицы: строки сотрудников, у которых
// суммарная длительность отпуска превышает 28 календарных дней, выделяются цветом.
//
&НаСервере
Процедура НастроитьПодсветкуПревышения()

	// Элемент оформления создается один раз, далее только обновляется список
	// сотрудников с превышением.
	Оформление = Неопределено;
	Для Каждого ЭлементОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.Имя = "ВКМ_ПревышениеДлительностиОтпуска" Тогда
			Оформление = ЭлементОформления;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Оформление = Неопределено Тогда
		Оформление = УсловноеОформление.Элементы.Добавить();
		Оформление.Имя = "ВКМ_ПревышениеДлительностиОтпуска";

		ПолеОформления = Оформление.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");

		// Цвет задается явно: подходящего элемента стиля в конфигурации нет.
		Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 225, 225));

		ЭлементОтбора = Оформление.Отбор.Элементы.Добавить(
			Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
			"Объект.ОтпускаСотрудников.Сотрудник");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;

	ЭлементОтбора = Оформление.Отбор.Элементы[0];
	ЭлементОтбора.ПравоеЗначение = СотрудникиСПревышением();

КонецПроцедуры

// Возвращает сотрудников, суммарная длительность отпусков которых
// в графике превышает 28 календарных дней.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ВКМ_Сотрудники - сотрудники с превышением.
//
&НаСервере
Функция СотрудникиСПревышением()

	ДлительностьПоСотрудникам = Новый Соответствие;

	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл

		Если Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;

		Дней = Цел((НачалоДня(СтрокаОтпуска.ДатаОкончания)
			- НачалоДня(СтрокаОтпуска.ДатаНачала)) / 86400) + 1;

		Текущее = ДлительностьПоСотрудникам.Получить(СтрокаОтпуска.Сотрудник);
		ДлительностьПоСотрудникам.Вставить(СтрокаОтпуска.Сотрудник,
			?(Текущее = Неопределено, 0, Текущее) + Дней);

	КонецЦикла;

	Результат = Новый Массив;
	Для Каждого КлючИЗначение Из ДлительностьПоСотрудникам Цикл
		Если КлючИЗначение.Значение > 28 Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
